src/cf/Catalogs/ВидыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ВидыПланов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВидовПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСогласуемогоРесурсаПлановыхРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСогласуемыхРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговоеЗначениеПрочихРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПериодичностьПланов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПериодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/СтатусыВидовПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыВидовПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеАктуален</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыПланов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Статус                              = Перечисления.СтатусыВидовПланов.Черновик;
	ВладелецПлана                       = Пользователи.ТекущийПользователь();
	ВидСогласуемогоРесурсаПлановыхРабот = Справочники.ВидыСогласуемыхРесурсов.ВидРесурсаПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеРесурсов") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидСогласуемогоРесурсаПлановыхРабот");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьДублиУчастников();
	СформироватьПредставлениеУчастников();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.ВидыПланов.УдалитьНеСоответствующиеНастройкамПланы(Ссылка);
	Если Статус = Перечисления.СтатусыВидовПланов.Действует Тогда
		Справочники.ВидыПланов.СоздатьПланыПоВидуПланаЕслиНеобходимо(Ссылка, НачалоДня(ТекущаяДатаСеанса()), 4);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьПредставлениеУчастников()
	
	УчастникиСтрокой = "";
	КоличествоУчастниковПланирования = УчастникиПланирования.Количество();
	
	Если КоличествоУчастниковПланирования = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоУчастниковПланирования > 3 Тогда
		УчастникиСтрокой = СтрШаблон(НСтр("ru = 'Участников - %1, в т.ч.'"), КоличествоУчастниковПланирования);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 3
	|	Пользователи.Представление КАК Представление
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка В(&МассивУчастников)";
	
	Запрос.УстановитьПараметр("МассивУчастников", УчастникиПланирования.ВыгрузитьКолонку("Участник"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Индекс = 0;
	
	Пока Выборка.Следующий() Цикл
	
		Если Индекс = 0 Тогда
			УчастникиСтрокой = УчастникиСтрокой + " ";
		Иначе
			УчастникиСтрокой = УчастникиСтрокой + ", ";
		КонецЕсли;
		
		УчастникиСтрокой = УчастникиСтрокой + Выборка.Представление;
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	УчастникиСтрокой = УчастникиСтрокой + ".";
	
КонецПроцедуры

Процедура ОчиститьДублиУчастников()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Участники.Участник    КАК Участник,
	|	Участники.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Участники
	|ИЗ
	|	&Участники КАК Участники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	Участники.Участник             КАК Участник,
	|	КОЛИЧЕСТВО(Участники.Участник) КАК Количество
	|ИЗ
	|	Участники КАК Участники
	|
	|СГРУППИРОВАТЬ ПО
	|	Участники.Участник
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(Участники.Участник) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Участник КАК Участник
	|ИЗ
	|	(ВЫБРАТЬ
	|		Участники.Участник КАК Участник,
	|		МИНИМУМ(Участники.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		Участники КАК Участники
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Участники.Участник) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.НомерСтроки";
	
	Запрос.УстановитьПараметр("Участники", УчастникиПланирования.Выгрузить());
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Результат[1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	УчастникиПланирования.Очистить();;
	
	Выборка = Результат[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = УчастникиПланирования.Добавить();
		НоваяСтрока.Участник = Выборка.Участник;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
